//DOGECOB  JOB  CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),NOTIFY=HERC02
//JOBPROC  DD DSN=HERC02.KICKSSYS.V1R5M0.PROCLIB,DISP=SHR
//* DOGE SEND MONEYS - compile and link DOGESEND only
//DOGESEND EXEC K2KCOBCL
//COPY.SYSUT1 DD DISP=SHR,DSN=HERC02.DOGECICS(DOGESEND)
//LKED.SYSIN DD *
 INCLUDE SKIKLOAD(KIKCOBGL)
 ENTRY DOGESEND
 NAME DOGESEND(R)
