000100 IDENTIFICATION DIVISION.
000200
000300 PROGRAM-ID.    DOT500.
000400
000500 AUTHOR.        **************************************************
000510                * Copyright (c) 2026 Broadcom.                   *
000520                * All Rights Reserved.                           *
000600                **************************************************
000700                **                                              **
000800                **   THE DOT SUBSYSTEM (DEPOSITORY OF ONLINE    **
000900                **   TRANSACTIONS) IS A PROPRIETARY SOFTWARE    **
001000                **   PRODUCT OF:                                **
001100                **                                              **
001200                **        TECHUTEX BANKING DIVISION             **
001300                **          PALO ALTO, CALIFORNIA               **
001400                **                                              **
001500                **   ANY USE OR DISCLOSURE OF THIS  SOFTWARE    **
001600                **   PRODUCT BY COMPANIES AND/OR INDIVIDUALS    **
001700                **   NOT DIRECTLY AFFILIATED WITH A LICENSEE    **
001800                **   OF THIS SOFTWARE PRODUCT IS PROHIBITED.    **
001900                **                                              **
002000                **************************************************
002100                **************************************************
002200
002300 DATE-COMPILED.
002400*
002500*REMARKS.       **************************************************
002600*               ****           DOT ACCOUNT TESTING            ****
002700*               **************************************************
002800*
002900*               THIS PROGRAM IS A PART OF THE DOT SUBSYSTEM AND IT
003000*               ACCEPTS THE DETAIL TRANSACTIONS (INSERT OR DELETE)
003100*               TO BE APPLIED TO THE DOT ONLINE FILE FOR  TESTING.
003200*               THUS, THE USER CAN INSERT AND DELETE THE NECESSARY
003300*               DOT DETAIL TRANSACTIONS FOR TESTING PURPOSES.
003400*
003500*               THE PROGRAM PERFORMS THE FOLLOWING SERVICES:
003600*
003700*               1.  INSERT ------------- INSERT DETAIL TRANSACTION
003800*               2.  DELETE ------------- DELETE DETAIL TRANSACTION
003900*
004000*               THE USER ENTERS "TEST" TRANSACTIONS BY  PROVIDIING
004100*               THE BANK NUMBER, ACCOUNT TYPE,  AND ACCOUNT NUMBER
004200*               ALONG WITH THE DOT DETAIL TRANSACTION FIELDS.  THE
004300*               DOT DETAIL TRANSACTIONS AND HEADER RECORDS  (I.E.;
004400*               ACCUMULATED DETAIL TRANSACTION TOTALS) CAN THEN BE
004500*               USED TO TEST THE USER'S ONLINE DELIVERY SERVICES.
004600*
004700*               THE PROGRAM CALLS THE DOT ACCOUNT SERVICE  PROGRAM
004800*               TO INSERT AND DELETE DETAIL "TEST" TRANSACTIONS ON
004900*               THE DOT ONLINE FILE (TEST FILE).  THE PROGRAM ALSO
005000*               CALLS THE USER SERVICE PROGRAM TO EDIT THE ACCOUNT
005100*               NUMBER (SCREEN KEY) AND TO FORMAT THE MASTER  FILE
005200*               RECORD KEY (MASTER KEY).
005300*
005400*               THE FOLLOWING INPUT AND OUTPUT MAPS ARE FORMATTED,
005500*               SENT, AND RECEIVED BY THE PROGRAM:
005600*
005700*               DESCRIPTION OF SCREEN MAP       -MAPSET-   MAPNAME
005800*               -------------------------       --------   -------
005900*
006000*               ACCOUNT DETAIL TRANSACTION       DOT500M   ACCTTRX
006100*
006200*               **************************************************
006300*               ****           DOT ACCOUNT TESTING            ****
006400*               **************************************************
006500     EJECT
006600 ENVIRONMENT DIVISION.
006700
006800 DATA DIVISION.
006900
007000 WORKING-STORAGE SECTION.
007100
007200******************************************************************
007300****                 WORKING STORAGE CONSTANTS                ****
007400******************************************************************
007500
007600 01  WS-PROGRAM-CONTROL.
007700
007800     05  WS-PROGRAM-NAME         PIC X(6)      VALUE 'DOT500'.
007900     05  WS-PROGRAM-LEVEL        PIC X(8)      VALUE '03.01.01'.
008000
008100 01  WS-PROGRAM-CONSTANTS.
008200
008300     05  WS-YES                  PIC X(1)      VALUE 'Y'.
008400     05  WS-NO                   PIC X(1)      VALUE 'N'.
008500     05  WS-ERROR                PIC X(1)      VALUE '*'.
008600     05  WS-CUTOFF-DATE          PIC 9(8)      VALUE 19000101.
008700
008800 01  WS-MAP-NAMES.
008900
009000     05  WS-DOT-MAPSET           PIC X(7)      VALUE 'DOT500M'.
009100     05  WS-DOT-TRX-MAP          PIC X(7)      VALUE 'ACCTTRX'.
009200
009300 01  WS-PROCESS-MAPS.
009400
009500     05  WS-INITIAL-MAP          PIC 9(1)      VALUE 1.
009600     05  WS-SCREEN-MAP           PIC 9(1)      VALUE 2.
009700
009800 01  WS-MAP-INDICATORS.
009900
010000     05  WS-SET-CURSOR           PIC S9(4)     VALUE -1    COMP.
010100     05  WS-CHR-HILITE           PIC X(1)      VALUE 'I'.
010200     05  WS-NBR-HILITE           PIC X(1)      VALUE 'R'.
010300     05  WS-SKP-HILITE           PIC X(1)      VALUE '1'.
010400     05  WS-BRT-HILITE           PIC X(1)      VALUE '9'.
010500     05  WS-DRK-HILITE           PIC X(1)      VALUE QUOTE.
010600     EJECT
010700******************************************************************
010800****                   PROGRAM USER MESSAGES                  ****
010900******************************************************************
011000
011100 01  WS-USER-MESSAGES.
011200
011300     05  WS-INSERTED-MSG         PIC X(35)     VALUE
011400                         'TRANSACTION INSERTED SUCCESSFULLY  '.

           05  WS-LIMIT-MSG            PIC X(35)     VALUE
                               'ERROR: DAILY DEBIT LIMIT EXCEEDED  '.
011500
011600     05  WS-DELETED-MSG          PIC X(35)     VALUE
011700                         'TRANSACTION DELETED SUCCESSFULLY   '.
011800
011900     05  WS-INPUT-ERROR-MSG      PIC X(35)     VALUE
012000                         'ERROR: TRANSACTION DATA NOT VALID  '.
012100
012200     05  WS-RECORD-MISSING-MSG   PIC X(35)     VALUE
012300                         'ERROR: DOT RECORD IS NOT ON FILE   '.
012400
012500     05  WS-INVALID-KEY-MSG   PIC X(35)        VALUE
012600                         'ERROR: INVALID FUNCTION KEY PRESSED'.
012700
012800     05  WS-TRAN-MISSING-MSG     PIC X(35)     VALUE
012900                         'ERROR: TRANSACTION NOT ON DOT FILE '.
013000
013100     05  WS-CORRECT-MSG          PIC X(35)     VALUE
013200                         'CORRECT AND RE-ENTER INPUT FIELD   '.
013300
013400     05  WS-CONTINUE-MSG         PIC X(35)     VALUE
013500                         'CONTINUE WITH NEXT DOT REQUEST     '.
013600
013700     05  WS-NOTIFY-MSG           PIC X(35)     VALUE
013800                         'NOTIFY SYSTEMS SUPPORT OF PROBLEM  '.
013900
014000     05  WS-PRESS-KEY-MSG        PIC X(35)     VALUE
014100                         'PRESS FUNCTION KEY AS SHOWN BELOW  '.
014200     EJECT
014300******************************************************************
014400****                  PROGRAM SERVICE ERRORS                  ****
014500******************************************************************
014600
014700 01  WS-SERVICE-ERRORS.
014800
014900     05  WS-PROG-MISSING-MSG     PIC X(35)     VALUE
015000                         'DOT500: XXXXXXXX PROGRAM MISSING   '.
015100
015200     05  WS-FILE-PROBLEM-MSG     PIC X(35)     VALUE
015300                         'DOT500: XXXXXXXX FILE PROBLEM      '.
015400
015500     05  WS-FILE-CLOSED-MSG      PIC X(35)     VALUE
015600                         'DOT500: XXXXXXXX FILE CLOSED       '.
015700
015800     05  WS-MAP-FAILURE-MSG      PIC X(35)     VALUE
015900                         'DOT500: DOT500   CICS MAP FAILURE  '.
016000
016100     05  WS-PROGRAM-ERROR-MSG    PIC X(35)     VALUE
016200                         'DOT500: DOT500   PROGRAM ERROR     '.
016300
016400     05  WS-SERVICE-ERROR-MSG    PIC X(35)     VALUE
016500                         'DOT500: XXXXXXXX SERVICE ERROR     '.
016600
016700     05  WS-SERIOUS-ERROR-MSG    PIC X(35)     VALUE
016800                         'DOT500: DOT500   SERIOUS ERROR     '.
016900     EJECT
017000     01  WS-DAILY-LIMIT-CONTROL.
         05  WS-DB-CEILING   PIC S9(9)V99  VALUE 5000.00 COMP-3.
         05  WS-DB-DAY-TOTAL PIC S9(9)V99  VALUE ZERO    COMP-3.
         05  WS-DB-NEW-TOTAL PIC S9(9)V99  VALUE ZERO    COMP-3.

     COPY DOTCONS.
017100******************************************************************
017200****                   CICS AID DEFINITIONS                   ****
017300******************************************************************
017400
017500     COPY DFHAID.
017600     EJECT
017700******************************************************************
017800****                 WORKING STORAGE WORK AREAS               ****
017900******************************************************************
018000
018100 01  WS-PROCESSING-FLAGS.
018200
018300     05  WS-RECORD-FOUND-FLAG    PIC X(1)      VALUE SPACES.
018400         88  RECORD-FOUND                      VALUE 'Y'.
018500     05  WS-END-OF-TRANS-FLAG    PIC X(1)      VALUE SPACES.
018600         88  END-OF-TRANS                      VALUE 'Y'.
018700
018800 01  WS-INPUT-ERROR-FLAGS.
018900
019000     05  WS-BANK-NUMBER-FLAG     PIC X(1)      VALUE SPACES.
019100         88  BANK-NUMBER-ERROR                 VALUE '*'.
019200     05  WS-ACCOUNT-TYPE-FLAG    PIC X(1)      VALUE SPACES.
019300         88  ACCOUNT-TYPE-ERROR                VALUE '*'.
019400     05  WS-ACCOUNT-KEY-FLAG     PIC X(1)      VALUE SPACES.
019500         88  ACCOUNT-KEY-ERROR                 VALUE '*'.
019600     05  WS-SERVICE-TYPE-FLAG    PIC X(1)      VALUE SPACES.
019700         88  SERVICE-TYPE-ERROR                VALUE '*'.
019800     05  WS-FORMAT-TYPE-FLAG     PIC X(1)      VALUE SPACES.
019900         88  FORMAT-TYPE-ERROR                 VALUE '*'.
020000     05  WS-TRAN-DATE-FLAG       PIC X(1)      VALUE SPACES.
020100         88  TRAN-DATE-ERROR                   VALUE '*'.
020200     05  WS-TRAN-CODE-FLAG       PIC X(1)      VALUE SPACES.
020300         88  TRAN-CODE-ERROR                   VALUE '*'.
020400     05  WS-TYPE-REASON-FLAG     PIC X(1)      VALUE SPACES.
020500         88  TYPE-REASON-ERROR                 VALUE '*'.
020600     05  WS-AMOUNT-1-FLAG        PIC X(1)      VALUE SPACES.
020700         88  AMOUNT-1-ERROR                    VALUE '*'.
020800     05  WS-AMOUNT-2-FLAG        PIC X(1)      VALUE SPACES.
020900         88  AMOUNT-2-ERROR                    VALUE '*'.
021000     05  WS-SERIAL-1-FLAG        PIC X(1)      VALUE SPACES.
021100         88  SERIAL-1-ERROR                    VALUE '*'.
021200     05  WS-SERIAL-2-FLAG        PIC X(1)      VALUE SPACES.
021300         88  SERIAL-2-ERROR                    VALUE '*'.
021400     05  WS-REL-DATE-FLAG        PIC X(1)      VALUE SPACES.
021500         88  REL-DATE-ERROR                    VALUE '*'.
021600     05  WS-ALERT-CODE-FLAG      PIC X(1)      VALUE SPACES.
021700         88  ALERT-CODE-ERROR                  VALUE '*'.
021800     05  WS-NMON-DATA-FLAG       PIC X(1)      VALUE SPACES.
021900         88  NMON-DATA-ERROR                   VALUE '*'.
022000
022100 01  WS-PROGRAM-WORK-AREAS.
022200
022300     05  WS-SERVICE-PROGRAM      PIC X(8)      VALUE SPACES.
022400     05  WS-SERVICE-FILE-NAME    PIC X(8)      VALUE SPACES.
022500     05  WS-ERROR-MESSAGE        PIC X(35)     VALUE SPACES.
022600     05  WS-USER-MESSAGE         PIC X(35)     VALUE SPACES.
022700
022800 01  WS-DATE-TIME-STAMPS.
022900
023000     05  WS-CICS-YEAR            PIC S9(8)     VALUE +0    COMP.
023100     05  WS-CICS-ABSTIME         PIC S9(15)    VALUE +0    COMP-3.
023200
023300     05  WS-CICS-DATE            PIC 9(6)      VALUE ZERO.
023400     05  WS-CICS-DATE-R          REDEFINES WS-CICS-DATE.
023500         10  WS-CICS-DATE-YY     PIC 9(2).
023600         10  WS-CICS-DATE-MM     PIC 9(2).
023700         10  WS-CICS-DATE-DD     PIC 9(2).
023800
023900     05  WS-CICS-TIME            PIC 9(6)      VALUE ZERO.
024000     05  WS-CICS-TIME-R          REDEFINES WS-CICS-TIME.
024100         10  WS-CICS-TIME-HH     PIC 9(2).
024200         10  WS-CICS-TIME-MM     PIC 9(2).
024300         10  WS-CICS-TIME-SS     PIC 9(2).
024400
024500     05  WS-SYSTEM-DATE          PIC 9(8)      VALUE ZERO.
024600     05  WS-SYSTEM-DATE-R        REDEFINES WS-SYSTEM-DATE.
024700         10  WS-SYSTEM-DATE-YYYY PIC 9(4).
024800         10  WS-SYSTEM-DATE-MM   PIC 9(2).
024900         10  WS-SYSTEM-DATE-DD   PIC 9(2).
025000
025100     05  WS-SYSTEM-TIME          PIC 9(6)      VALUE ZERO.
025200     05  WS-SYSTEM-TIME-R        REDEFINES WS-SYSTEM-TIME.
025300         10  WS-SYSTEM-TIME-HH   PIC 9(2).
025400         10  WS-SYSTEM-TIME-MM   PIC 9(2).
025500         10  WS-SYSTEM-TIME-SS   PIC 9(2).
025600
025700     05  WS-SCREEN-DATE          PIC X(10)     VALUE 'YYYY-MM-DD'.
025800     05  WS-SCREEN-DATE-R        REDEFINES WS-SCREEN-DATE.
025900         10  WS-SCREEN-DATE-YYYY PIC 9(4).
026000         10  FILLER              PIC X(1).
026100         10  WS-SCREEN-DATE-MM   PIC 9(2).
026200         10  FILLER              PIC X(1).
026300         10  WS-SCREEN-DATE-DD   PIC 9(2).
026400
026500     05  WS-SCREEN-TIME          PIC X(8)      VALUE 'HH:MM:SS'.
026600     05  WS-SCREEN-TIME-R        REDEFINES WS-SCREEN-TIME.
026700         10  WS-SCREEN-TIME-HH   PIC 9(2).
026800         10  FILLER              PIC X(1).
026900         10  WS-SCREEN-TIME-MM   PIC 9(2).
027000         10  FILLER              PIC X(1).
027100         10  WS-SCREEN-TIME-SS   PIC 9(2).
027200
027300 01  WS-MESSAGE-WORK-AREA.
027400
027500     05  WS-MESSAGE-LINE         PIC X(35)     VALUE
027600                         'DOT500: XXXXXXXX XXXXXXXXXXXXXXXXXX'.
027700     05  WS-MESSAGE-LINE-R REDEFINES WS-MESSAGE-LINE.
027800         10  WS-MSG-PROGRAM      PIC X(6).
027900         10  FILLER              PIC X(2).
028000         10  WS-MSG-RESOURCE     PIC X(8).
028100         10  FILLER              PIC X(1).
028200         10  WS-MSG-CONTENTS     PIC X(18).
028300     EJECT
028400******************************************************************
028500****                  INPUT TRANSACTION AREA                  ****
028600******************************************************************
028700
028800 01  WS-INPUT-TRANSACTION.
028900
029000     05  WS-TRX-BANK-NUMBER      PIC 9(3)      VALUE ZERO  COMP-3.
029100     05  WS-TRX-ACCOUNT-TYPE     PIC X(2)      VALUE SPACES.
029200     05  WS-TRX-ACCOUNT-KEY      PIC X(20)     VALUE SPACES.
029300
029400     05  WS-TRX-SERVICE-TYPE     PIC X(3)      VALUE SPACES.
029500
029600         88  TRX-TPS-TYPE                      VALUE 'TPS'.
029700         88  TRX-ATM-TYPE                      VALUE 'ATM'.
029800         88  TRX-POS-TYPE                      VALUE 'POS'.
029900         88  TRX-EBS-TYPE                      VALUE 'EBS'.
030000         88  TRX-ACH-TYPE                      VALUE 'ACH'.
030100
030200     05  WS-TRX-FORMAT-TYPE      PIC X(2)      VALUE SPACES.
030300
030400         88  TRX-DB-TYPE                       VALUE 'DB'.
030500         88  TRX-CR-TYPE                       VALUE 'CR'.
030600         88  TRX-HD-TYPE                       VALUE 'HD'.
030700         88  TRX-SP-TYPE                       VALUE 'SP'.
030800         88  TRX-NM-TYPE                       VALUE 'NM'.
030900
031000     05  WS-TRX-TRAN-DATE        PIC 9(8)      VALUE ZERO  COMP-3.
031100     05  WS-TRX-TRAN-CODE        PIC 9(3)      VALUE ZERO  COMP-3.
031200     05  WS-TRX-TYPE-REASON      PIC 9(2)      VALUE ZERO.
031300     05  WS-TRX-TYPE-REASON-1    REDEFINES WS-TRX-TYPE-REASON.
031400         10  WS-TRX-HOLD-TYPE    PIC 9(2).
031500     05  WS-TRX-TYPE-REASON-2    REDEFINES WS-TRX-TYPE-REASON.
031600         10  WS-TRX-STOP-TYPE    PIC 9(1).
031700         10  WS-TRX-STOP-REASON  PIC 9(1).
031800     05  WS-TRX-AMOUNT-1         PIC 9(9)V99   VALUE ZERO  COMP-3.
031900     05  WS-TRX-AMOUNT-2         PIC 9(9)V99   VALUE ZERO  COMP-3.
032000     05  WS-TRX-SERIAL-1         PIC 9(9)      VALUE ZERO  COMP-3.
032100     05  WS-TRX-SERIAL-2         PIC 9(9)      VALUE ZERO  COMP-3.
032200     05  WS-TRX-REL-DATE         PIC 9(8)      VALUE ZERO  COMP-3.
032300     05  WS-TRX-ALERT-CODE       PIC 9(1)      VALUE ZERO.
032400     05  WS-TRX-NMON-DATA        PIC X(20)     VALUE SPACES.
032500     EJECT
032600******************************************************************
032700****                  DOT TRANSACTION MAP                     ****
032800******************************************************************
032900
033000 01  DOT-TRANSACTION-MAP.
033100
033200     05  MAP-TRX-CONTROL         PIC X(12).
033300
033400     05  MAP-TRX-CICS-DATE-L     PIC S9(4)                 COMP.
033500     05  MAP-TRX-CICS-DATE-A     PIC X(1).
033600     05  MAP-TRX-CICS-DATE       PIC X(10).
033700
033800     05  MAP-TRX-CICS-TIME-L     PIC S9(4)                 COMP.
033900     05  MAP-TRX-CICS-TIME-A     PIC X(1).
034000     05  MAP-TRX-CICS-TIME       PIC X(8).
034100
034200     05  MAP-TRX-BANK-NUMBER-L   PIC S9(4)                 COMP.
034300     05  MAP-TRX-BANK-NUMBER-A   PIC X(1).
034400     05  MAP-TRX-BANK-NUMBER     PIC 9(3).
034500
034600     05  MAP-TRX-ACCOUNT-TYPE-L  PIC S9(4)                 COMP.
034700     05  MAP-TRX-ACCOUNT-TYPE-A  PIC X(1).
034800     05  MAP-TRX-ACCOUNT-TYPE    PIC X(2).
034900
035000     05  MAP-TRX-ACCOUNT-KEY-L   PIC S9(4)                 COMP.
035100     05  MAP-TRX-ACCOUNT-KEY-A   PIC X(1).
035200     05  MAP-TRX-ACCOUNT-KEY     PIC X(20).
035300
035400     05  MAP-TRX-SERVICE-TYPE-L  PIC S9(4)                 COMP.
035500     05  MAP-TRX-SERVICE-TYPE-A  PIC X(1).
035600     05  MAP-TRX-SERVICE-TYPE    PIC X(3).
035700
035800     05  MAP-TRX-FORMAT-TYPE-L   PIC S9(4)                 COMP.
035900     05  MAP-TRX-FORMAT-TYPE-A   PIC X(1).
036000     05  MAP-TRX-FORMAT-TYPE     PIC X(2).
036100
036200     05  MAP-TRX-TRAN-DATE-L     PIC S9(4)                 COMP.
036300     05  MAP-TRX-TRAN-DATE-A     PIC X(1).
036400     05  MAP-TRX-TRAN-DATE       PIC 9(8).
036500
036600     05  MAP-TRX-TRAN-CODE-L     PIC S9(4)                 COMP.
036700     05  MAP-TRX-TRAN-CODE-A     PIC X(1).
036800     05  MAP-TRX-TRAN-CODE       PIC 9(3).
036900
037000     05  MAP-TRX-TYPE-REASON-L   PIC S9(4)                 COMP.
037100     05  MAP-TRX-TYPE-REASON-A   PIC X(1).
037200     05  MAP-TRX-TYPE-REASON     PIC 9(2).
037300
037400     05  MAP-TRX-AMOUNT-1-L      PIC S9(4)                 COMP.
037500     05  MAP-TRX-AMOUNT-1-A      PIC X(1).
037600     05  MAP-TRX-AMOUNT-1        PIC 9(9)V99.
037700
037800     05  MAP-TRX-AMOUNT-2-L      PIC S9(4)                 COMP.
037900     05  MAP-TRX-AMOUNT-2-A      PIC X(1).
038000     05  MAP-TRX-AMOUNT-2        PIC 9(9)V99.
038100
038200     05  MAP-TRX-SERIAL-1-L      PIC S9(4)                 COMP.
038300     05  MAP-TRX-SERIAL-1-A      PIC X(1).
038400     05  MAP-TRX-SERIAL-1        PIC 9(9).
038500
038600     05  MAP-TRX-SERIAL-2-L      PIC S9(4)                 COMP.
038700     05  MAP-TRX-SERIAL-2-A      PIC X(1).
038800     05  MAP-TRX-SERIAL-2        PIC 9(9).
038900
039000     05  MAP-TRX-REL-DATE-L      PIC S9(4)                 COMP.
039100     05  MAP-TRX-REL-DATE-A      PIC X(1).
039200     05  MAP-TRX-REL-DATE        PIC 9(8).
039300
039400     05  MAP-TRX-ALERT-CODE-L    PIC S9(4)                 COMP.
039500     05  MAP-TRX-ALERT-CODE-A    PIC X(1).
039600     05  MAP-TRX-ALERT-CODE      PIC 9(1).
039700
039800     05  MAP-TRX-NMON-DATA-L     PIC S9(4)                 COMP.
039900     05  MAP-TRX-NMON-DATA-A     PIC X(1).
040000     05  MAP-TRX-NMON-DATA       PIC X(20).
040100
040200     05  MAP-TRX-ERROR-MSG-L     PIC S9(4)                 COMP.
040300     05  MAP-TRX-ERROR-MSG-A     PIC X(1).
040400     05  MAP-TRX-ERROR-MSG       PIC X(35).
040500
040600     05  MAP-TRX-USER-MSG-L      PIC S9(4)                 COMP.
040700     05  MAP-TRX-USER-MSG-A      PIC X(1).
040800     05  MAP-TRX-USER-MSG        PIC X(35).
040900     EJECT
041000******************************************************************
041100****                  PROGRAM SERVICE COMMAREA                ****
041200******************************************************************
041300
041400 01  PGM-SERVICE-COMMAREA.
041500
041600     05  PGM-COMM-PROCESS-MAP    PIC 9(1).
041700
041800         88  INITIAL-MAP                       VALUE 1.
041900         88  SCREEN-MAP                        VALUE 2.
042000
042100     05  PGM-COMM-LENGTH         PIC S9(4)                  COMP.
042200     EJECT
042300 01  DOT-SERVICE-COMMAREA.
042400
042500     COPY DOTCOMM.
042600     COPY DOTRECD.
042700 01  USER-SERVICE-COMMAREA.
042800
042900     COPY DOTUSER.
043000     COPY DUPDATEL.
043100******************************************************************
043200****                 CICS INFORMATION AREAS                   ****
043300******************************************************************
043400
043500 LINKAGE SECTION.
043600
043700 01  DFHCOMMAREA                 PIC X(20).
043800     EJECT
043900 PROCEDURE DIVISION.
044000
044100******************************************************************
044200****                PROGRAM MAIN LINE PROCEDURE               ****
044300******************************************************************
044400
044500 0000-MAIN-LINE                  SECTION.
044600
044700     PERFORM 1000-INITIALIZE-PROGRAM.
044800
044900     PERFORM 2000-PROCESS-USER-INPUT.
045000
045100     PERFORM 9900-RETURN-TO-PROGRAM.
045200
045300 0000-SECTION-EXIT.
045400
045500     GOBACK.
045600     EJECT
045700******************************************************************
045800****              INITIALIZE PROGRAM PROCEDURE                ****
045900******************************************************************
046000
046100 1000-INITIALIZE-PROGRAM         SECTION.
046200
046300     PERFORM 9000-SET-HANDLE-CONDITIONS.
046400
046500     IF EIBAID EQUAL DFHCLEAR
046600        OR
046700        EIBAID EQUAL DFHPA1
046800        OR
046900        EIBAID EQUAL DFHPA2
047000        OR
047100        EIBAID EQUAL DFHPA3
047200         PERFORM 9999-RETURN-TO-CICS.
047300
047400     EXEC CICS ASKTIME
047500               ABSTIME (WS-CICS-ABSTIME)
047600     END-EXEC.
047700
047800     EXEC CICS FORMATTIME
047900               ABSTIME (WS-CICS-ABSTIME)
048000               YEAR    (WS-CICS-YEAR)
048100               YYMMDD  (WS-CICS-DATE)
048200               TIME    (WS-CICS-TIME)
048300     END-EXEC.
048400
048500     MOVE WS-CICS-YEAR           TO WS-SYSTEM-DATE-YYYY.
048600     MOVE WS-CICS-DATE-MM        TO WS-SYSTEM-DATE-MM.
048700     MOVE WS-CICS-DATE-DD        TO WS-SYSTEM-DATE-DD.
048800
048900     MOVE WS-CICS-TIME-HH        TO WS-SYSTEM-TIME-HH.
049000     MOVE WS-CICS-TIME-MM        TO WS-SYSTEM-TIME-MM.
049100     MOVE WS-CICS-TIME-SS        TO WS-SYSTEM-TIME-SS.
049200
049300     INITIALIZE DOT-SERVICE-COMMAREA.
049400
049500 1000-SECTION-EXIT.
049600
049700     EXIT.
049800     EJECT
049900******************************************************************
050000****               PROCESS USER INPUT PROCEDURE               ****
050100******************************************************************
050200
050300 2000-PROCESS-USER-INPUT         SECTION.
050400
050500     IF EIBCALEN EQUAL ZERO
050600         INITIALIZE PGM-SERVICE-COMMAREA
050700         MOVE WS-INITIAL-MAP     TO PGM-COMM-PROCESS-MAP
050800     ELSE
050900         MOVE DFHCOMMAREA        TO PGM-SERVICE-COMMAREA.
051000
051100     IF INITIAL-MAP
051200        OR
051300        EIBAID EQUAL DFHPF1
051400         MOVE WS-INITIAL-MAP     TO PGM-COMM-PROCESS-MAP
051500         PERFORM 3500-SEND-SCREEN-MAP
051600         GO TO 2000-SECTION-EXIT.
051700
051800     PERFORM 3000-RECEIVE-SCREEN-MAP.
051900
052000     IF WS-INPUT-ERROR-FLAGS NOT EQUAL SPACES
052100         MOVE WS-INPUT-ERROR-MSG TO WS-ERROR-MESSAGE
052200         MOVE WS-CORRECT-MSG     TO WS-USER-MESSAGE
052300         PERFORM 3900-RESEND-SCREEN-MAP
052400         GO TO 2000-SECTION-EXIT.
052500
052600     IF EIBAID EQUAL DFHPF2
052700         PERFORM 4000-INSERT-TRANSACTION
052800     ELSE
052900     IF EIBAID EQUAL DFHPF3
053000         PERFORM 5000-DELETE-TRANSACTION
053100     ELSE
053200         MOVE WS-INVALID-KEY-MSG TO WS-ERROR-MESSAGE
053300         MOVE WS-PRESS-KEY-MSG   TO WS-USER-MESSAGE
053400         PERFORM 3900-RESEND-SCREEN-MAP.
053500
053600 2000-SECTION-EXIT.
053700
053800     EXIT.
053900     EJECT
054000******************************************************************
054100****               RECEIVE SCREEN MAP PROCEDURE               ****
054200******************************************************************
054300
054400 3000-RECEIVE-SCREEN-MAP         SECTION.
054500
054600     EXEC CICS RECEIVE
054700               MAPSET (WS-DOT-MAPSET)
054800               MAP    (WS-DOT-TRX-MAP)
054900               INTO   (DOT-TRANSACTION-MAP)
055000     END-EXEC.
055100
055200     IF MAP-TRX-BANK-NUMBER NUMERIC
055300         MOVE MAP-TRX-BANK-NUMBER
055400                                 TO WS-TRX-BANK-NUMBER
055500     ELSE
055600         MOVE ZERO               TO WS-TRX-BANK-NUMBER.
055700
055800     IF MAP-TRX-ACCOUNT-TYPE EQUAL (SPACES OR LOW-VALUES)
055900         MOVE SPACES             TO WS-TRX-ACCOUNT-TYPE
056000     ELSE
056100         MOVE MAP-TRX-ACCOUNT-TYPE TO WS-TRX-ACCOUNT-TYPE.
056200
056300     IF MAP-TRX-ACCOUNT-KEY EQUAL (SPACES OR LOW-VALUES)
056400         MOVE SPACES             TO WS-TRX-ACCOUNT-KEY
056500     ELSE
056600         MOVE MAP-TRX-ACCOUNT-KEY
056700                                 TO WS-TRX-ACCOUNT-KEY.
056800
056900**** HSC CUSTOM CODE FOR ONLINE DEMONSTRATION *******************
057000
057100     IF WS-TRX-ACCOUNT-KEY EQUAL 'DEMO'
057200         IF WS-TRX-ACCOUNT-TYPE EQUAL 'DD'
057300             MOVE '101123456'        TO WS-TRX-ACCOUNT-KEY
057400         ELSE
057500         IF WS-TRX-ACCOUNT-TYPE EQUAL 'SS'
057600             MOVE '1101123456'       TO WS-TRX-ACCOUNT-KEY
057700         ELSE
057800         IF WS-TRX-ACCOUNT-TYPE EQUAL 'TD'
057900             MOVE '1101123456'       TO WS-TRX-ACCOUNT-KEY.
058000
058100**** END CUSTOM CODE FOR ONLINE DEMONSTRATION *******************
058200
058300     IF MAP-TRX-SERVICE-TYPE EQUAL (SPACES OR LOW-VALUES)
058400         MOVE SPACES             TO WS-TRX-SERVICE-TYPE
058500     ELSE
058600         MOVE MAP-TRX-SERVICE-TYPE TO WS-TRX-SERVICE-TYPE.
058700
058800     IF MAP-TRX-FORMAT-TYPE EQUAL (SPACES OR LOW-VALUES)
058900         MOVE SPACES             TO WS-TRX-FORMAT-TYPE
059000     ELSE
059100         MOVE MAP-TRX-FORMAT-TYPE TO WS-TRX-FORMAT-TYPE.
059200
059300     IF MAP-TRX-TRAN-DATE NUMERIC
059400         MOVE MAP-TRX-TRAN-DATE  TO WS-TRX-TRAN-DATE
059500     ELSE
059600         MOVE ZERO               TO WS-TRX-TRAN-DATE.
059700
059800     IF MAP-TRX-TRAN-CODE NUMERIC
059900         MOVE MAP-TRX-TRAN-CODE  TO WS-TRX-TRAN-CODE
060000     ELSE
060100         MOVE ZERO               TO WS-TRX-TRAN-CODE.
060200
060300     IF MAP-TRX-TYPE-REASON NUMERIC
060400         MOVE MAP-TRX-TYPE-REASON
060500                                 TO WS-TRX-TYPE-REASON
060600     ELSE
060700         MOVE ZERO               TO WS-TRX-TYPE-REASON.
060800
060900     IF MAP-TRX-AMOUNT-1 NUMERIC
061000         MOVE MAP-TRX-AMOUNT-1   TO WS-TRX-AMOUNT-1
061100     ELSE
061200         MOVE ZERO               TO WS-TRX-AMOUNT-1.
061300
061400     IF MAP-TRX-AMOUNT-2 NUMERIC
061500         MOVE MAP-TRX-AMOUNT-2   TO WS-TRX-AMOUNT-2
061600     ELSE
061700         MOVE ZERO               TO WS-TRX-AMOUNT-2.
061800
061900     IF MAP-TRX-SERIAL-1 NUMERIC
062000         MOVE MAP-TRX-SERIAL-1   TO WS-TRX-SERIAL-1
062100     ELSE
062200         MOVE ZERO               TO WS-TRX-SERIAL-1.
062300
062400     IF MAP-TRX-SERIAL-2 NUMERIC
062500         MOVE MAP-TRX-SERIAL-2   TO WS-TRX-SERIAL-2
062600     ELSE
062700         MOVE ZERO               TO WS-TRX-SERIAL-2.
062800
062900     IF MAP-TRX-REL-DATE NUMERIC
063000         MOVE MAP-TRX-REL-DATE   TO WS-TRX-REL-DATE
063100     ELSE
063200         MOVE ZERO               TO WS-TRX-REL-DATE.
063300
063400     IF MAP-TRX-ALERT-CODE NUMERIC
063500         MOVE MAP-TRX-ALERT-CODE TO WS-TRX-ALERT-CODE
063600     ELSE
063700         MOVE ZERO               TO WS-TRX-ALERT-CODE.
063800
063900     IF MAP-TRX-NMON-DATA EQUAL (SPACES OR LOW-VALUES)
064000         MOVE SPACES             TO WS-TRX-NMON-DATA
064100     ELSE
064200         MOVE MAP-TRX-NMON-DATA TO WS-TRX-NMON-DATA.
064300
064400     PERFORM 6000-EDIT-SCREEN-DATA.
064500
064600 3000-SECTION-EXIT.
064700
064800     EXIT.
064900     EJECT
065000******************************************************************
065100****                 SEND SCREEN MAP PROCEDURE                ****
065200******************************************************************
065300
065400 3500-SEND-SCREEN-MAP            SECTION.
065500
065600     MOVE LOW-VALUES             TO DOT-TRANSACTION-MAP.
065700     MOVE WS-SCREEN-MAP          TO PGM-COMM-PROCESS-MAP.
065800
065900     MOVE WS-SYSTEM-DATE-YYYY    TO WS-SCREEN-DATE-YYYY.
066000     MOVE WS-SYSTEM-DATE-MM      TO WS-SCREEN-DATE-MM.
066100     MOVE WS-SYSTEM-DATE-DD      TO WS-SCREEN-DATE-DD.
066200     MOVE WS-SCREEN-DATE         TO MAP-TRX-CICS-DATE.
066300
066400     MOVE WS-SYSTEM-TIME-HH      TO WS-SCREEN-TIME-HH.
066500     MOVE WS-SYSTEM-TIME-MM      TO WS-SCREEN-TIME-MM.
066600     MOVE WS-SYSTEM-TIME-SS      TO WS-SCREEN-TIME-SS.
066700     MOVE WS-SCREEN-TIME         TO MAP-TRX-CICS-TIME.
066800
066900     MOVE WS-SET-CURSOR          TO MAP-TRX-BANK-NUMBER-L.
067000
067100     EXEC CICS SEND
067200               MAPSET (WS-DOT-MAPSET)
067300               MAP    (WS-DOT-TRX-MAP)
067400               FROM   (DOT-TRANSACTION-MAP)
067500               CURSOR
067600               ERASE
067700     END-EXEC.
067800
067900 3500-SECTION-EXIT.
068000
068100     EXIT.
068200     EJECT
068300******************************************************************
068400****                RESEND SCREEN MAP PROCEDURE               ****
068500******************************************************************
068600
068700 3900-RESEND-SCREEN-MAP          SECTION.
068800
068900     MOVE WS-SCREEN-MAP          TO PGM-COMM-PROCESS-MAP.
069000     MOVE LOW-VALUES             TO DOT-TRANSACTION-MAP.
069100
069200     MOVE WS-SYSTEM-DATE-YYYY    TO WS-SCREEN-DATE-YYYY.
069300     MOVE WS-SYSTEM-DATE-MM      TO WS-SCREEN-DATE-MM.
069400     MOVE WS-SYSTEM-DATE-DD      TO WS-SCREEN-DATE-DD.
069500     MOVE WS-SCREEN-DATE         TO MAP-TRX-CICS-DATE.
069600
069700     MOVE WS-SYSTEM-TIME-HH      TO WS-SCREEN-TIME-HH.
069800     MOVE WS-SYSTEM-TIME-MM      TO WS-SCREEN-TIME-MM.
069900     MOVE WS-SYSTEM-TIME-SS      TO WS-SCREEN-TIME-SS.
070000     MOVE WS-SCREEN-TIME         TO MAP-TRX-CICS-TIME.
070100
070200     IF WS-INPUT-ERROR-FLAGS EQUAL SPACES
070300         MOVE WS-SET-CURSOR      TO MAP-TRX-BANK-NUMBER-L
070400     ELSE
070500     IF BANK-NUMBER-ERROR
070600         MOVE WS-SET-CURSOR      TO MAP-TRX-BANK-NUMBER-L
070700         MOVE WS-NBR-HILITE      TO MAP-TRX-BANK-NUMBER-A.
070800
070900     IF BANK-NUMBER-ERROR
071000        OR
071100        WS-TRX-BANK-NUMBER NOT EQUAL ZERO
071200         MOVE WS-TRX-BANK-NUMBER TO MAP-TRX-BANK-NUMBER.
071300
071400     IF ACCOUNT-TYPE-ERROR
071500         MOVE WS-SET-CURSOR      TO MAP-TRX-ACCOUNT-TYPE-L
071600         MOVE WS-CHR-HILITE      TO MAP-TRX-ACCOUNT-TYPE-A.
071700
071800     MOVE WS-TRX-ACCOUNT-TYPE    TO MAP-TRX-ACCOUNT-TYPE.
071900
072000     IF ACCOUNT-KEY-ERROR
072100         MOVE WS-SET-CURSOR      TO MAP-TRX-ACCOUNT-KEY-L
072200         MOVE WS-CHR-HILITE      TO MAP-TRX-ACCOUNT-KEY-A.
072300
072400     MOVE WS-TRX-ACCOUNT-KEY     TO MAP-TRX-ACCOUNT-KEY.
072500
072600     IF SERVICE-TYPE-ERROR
072700         MOVE WS-SET-CURSOR      TO MAP-TRX-SERVICE-TYPE-L
072800         MOVE WS-CHR-HILITE      TO MAP-TRX-SERVICE-TYPE-A.
072900
073000     MOVE WS-TRX-SERVICE-TYPE    TO MAP-TRX-SERVICE-TYPE.
073100
073200     IF FORMAT-TYPE-ERROR
073300         MOVE WS-SET-CURSOR      TO MAP-TRX-FORMAT-TYPE-L
073400         MOVE WS-CHR-HILITE      TO MAP-TRX-FORMAT-TYPE-A.
073500
073600     MOVE WS-TRX-FORMAT-TYPE     TO MAP-TRX-FORMAT-TYPE.
073700
073800     IF TRAN-DATE-ERROR
073900         MOVE WS-SET-CURSOR      TO MAP-TRX-TRAN-DATE-L
074000         MOVE WS-NBR-HILITE      TO MAP-TRX-TRAN-DATE-A.
074100
074200     IF WS-TRX-TRAN-DATE NOT EQUAL ZERO
074300         MOVE WS-TRX-TRAN-DATE   TO MAP-TRX-TRAN-DATE.
074400
074500     IF TRAN-CODE-ERROR
074600         MOVE WS-SET-CURSOR      TO MAP-TRX-TRAN-CODE-L
074700         MOVE WS-NBR-HILITE      TO MAP-TRX-TRAN-CODE-A.
074800
074900     IF TRAN-CODE-ERROR
075000        OR
075100        WS-TRX-TRAN-CODE NOT EQUAL ZERO
075200         MOVE WS-TRX-TRAN-CODE   TO MAP-TRX-TRAN-CODE.
075300
075400     IF TYPE-REASON-ERROR
075500         MOVE WS-SET-CURSOR      TO MAP-TRX-TYPE-REASON-L
075600         MOVE WS-NBR-HILITE      TO MAP-TRX-TYPE-REASON-A.
075700
075800     IF TYPE-REASON-ERROR
075900        OR
076000        WS-TRX-TYPE-REASON NOT EQUAL ZERO
076100         MOVE WS-TRX-TYPE-REASON TO MAP-TRX-TYPE-REASON.
076200
076300     IF AMOUNT-1-ERROR
076400         MOVE WS-SET-CURSOR      TO MAP-TRX-AMOUNT-1-L
076500         MOVE WS-NBR-HILITE      TO MAP-TRX-AMOUNT-1-A.
076600
076700     IF AMOUNT-1-ERROR
076800        OR
076900        WS-TRX-AMOUNT-1 NOT EQUAL ZERO
077000         MOVE WS-TRX-AMOUNT-1    TO MAP-TRX-AMOUNT-1.
077100
077200     IF AMOUNT-2-ERROR
077300         MOVE WS-SET-CURSOR      TO MAP-TRX-AMOUNT-2-L
077400         MOVE WS-NBR-HILITE      TO MAP-TRX-AMOUNT-2-A.
077500
077600     IF AMOUNT-2-ERROR
077700        OR
077800        WS-TRX-AMOUNT-2 NOT EQUAL ZERO
077900         MOVE WS-TRX-AMOUNT-2    TO MAP-TRX-AMOUNT-2.
078000
078100     IF SERIAL-1-ERROR
078200         MOVE WS-SET-CURSOR      TO MAP-TRX-SERIAL-1-L
078300         MOVE WS-NBR-HILITE      TO MAP-TRX-SERIAL-1-A.
078400
078500     IF SERIAL-1-ERROR
078600        OR
078700        WS-TRX-SERIAL-1 NOT EQUAL ZERO
078800         MOVE WS-TRX-SERIAL-1    TO MAP-TRX-SERIAL-1.
078900
079000     IF SERIAL-2-ERROR
079100         MOVE WS-SET-CURSOR      TO MAP-TRX-SERIAL-2-L
079200         MOVE WS-NBR-HILITE      TO MAP-TRX-SERIAL-2-A.
079300
079400     IF SERIAL-2-ERROR
079500        OR
079600        WS-TRX-SERIAL-2 NOT EQUAL ZERO
079700         MOVE WS-TRX-SERIAL-2    TO MAP-TRX-SERIAL-2.
079800
079900     IF REL-DATE-ERROR
080000         MOVE WS-SET-CURSOR      TO MAP-TRX-REL-DATE-L
080100         MOVE WS-NBR-HILITE      TO MAP-TRX-REL-DATE-A.
080200
080300     IF WS-TRX-REL-DATE NOT EQUAL ZERO
080400         MOVE WS-TRX-REL-DATE    TO MAP-TRX-REL-DATE.
080500
080600     IF ALERT-CODE-ERROR
080700         MOVE WS-SET-CURSOR      TO MAP-TRX-ALERT-CODE-L
080800         MOVE WS-NBR-HILITE      TO MAP-TRX-ALERT-CODE-A.
080900
081000     IF ALERT-CODE-ERROR
081100        OR
081200        WS-TRX-ALERT-CODE NOT EQUAL ZERO
081300         MOVE WS-TRX-ALERT-CODE  TO MAP-TRX-ALERT-CODE.
081400
081500     IF NMON-DATA-ERROR
081600         MOVE WS-SET-CURSOR      TO MAP-TRX-NMON-DATA-L
081700         MOVE WS-CHR-HILITE      TO MAP-TRX-NMON-DATA-A.
081800
081900     IF NMON-DATA-ERROR
082000        OR
082100        WS-TRX-NMON-DATA NOT EQUAL SPACES
082200         MOVE WS-TRX-NMON-DATA   TO MAP-TRX-NMON-DATA.
082300
082400     MOVE WS-ERROR-MESSAGE       TO MAP-TRX-ERROR-MSG.
082500     MOVE WS-USER-MESSAGE        TO MAP-TRX-USER-MSG.
082600
082700     EXEC CICS SEND
082800               MAPSET (WS-DOT-MAPSET)
082900               MAP    (WS-DOT-TRX-MAP)
083000               FROM   (DOT-TRANSACTION-MAP)
083100               CURSOR
083200               ERASE
083300     END-EXEC.
083400
083500 3900-SECTION-EXIT.
083600
083700     EXIT.
083800     EJECT
083900******************************************************************
084000****            INSERT DOT TRANSACTION PROCEDURE              ****
084100******************************************************************
084200
084300 4000-INSERT-TRANSACTION         SECTION.
084400
           IF TRX-DB-TYPE
               PERFORM 4100-CHECK-DAILY-LIMIT.

           IF TRX-DB-TYPE
              AND
              WS-DB-NEW-TOTAL GREATER THAN WS-DB-CEILING
               MOVE WS-LIMIT-MSG          TO WS-ERROR-MESSAGE
               MOVE WS-CORRECT-MSG        TO WS-USER-MESSAGE
               PERFORM 3900-RESEND-SCREEN-MAP
               GO TO 4000-SECTION-EXIT.

084500     INITIALIZE DOT-ONLINE-RECORD.
084600
084700     MOVE USER-COMM-BANK-NUMBER  TO DOT-BANK-NUMBER.
084800     MOVE USER-COMM-ACCOUNT-TYPE TO DOT-ACCOUNT-TYPE.
084900     MOVE USER-COMM-MASTER-KEY   TO DOT-ACCOUNT-KEY.
085000     MOVE WS-SYSTEM-DATE         TO DOT-CICS-DATE-STAMP.
085100     MOVE WS-SYSTEM-TIME         TO DOT-CICS-TIME-STAMP.
085200     MOVE EIBTASKN               TO DOT-CICS-TASK-STAMP.
085300     MOVE 1                      TO DOT-USER-ITEM-STAMP.
085400
085500     MOVE WS-TRX-SERVICE-TYPE    TO DOT-SERVICE-TYPE.
085600     MOVE WS-TRX-FORMAT-TYPE     TO DOT-FORMAT-TYPE.
085700     MOVE EIBTRMID               TO DOT-CICS-TERM-ID.
085800
085900     EXEC CICS ASSIGN
086000               OPID (DOT-CICS-USER-ID)
086100     END-EXEC.
086200
086300     MOVE EIBTRNID               TO DOT-CICS-TRAN-ID.
086400     MOVE WS-PROGRAM-NAME        TO DOT-CICS-PROG-ID.
086500     MOVE WS-TRX-TRAN-DATE       TO DOT-PROCESS-DATE.
086600
086700     IF TRX-DB-TYPE
086800         MOVE WS-TRX-TRAN-CODE   TO DOT-DB-TRAN-CODE
086900         MOVE WS-TRX-TRAN-DATE   TO DOT-DB-TRAN-DATE
087000         MOVE WS-TRX-AMOUNT-1    TO DOT-DB-TRAN-AMOUNT
087100         MOVE WS-TRX-SERIAL-1    TO DOT-DB-TRAN-SERIAL
087200         MOVE SPACES             TO DOT-DB-TRAN-DESC-1
087300                                    DOT-DB-TRAN-DESC-2
087400                                    DOT-DB-TRAN-DESC-3
087500                                    DOT-DB-REL-ACCT-KEY
087600         MOVE WS-TRX-AMOUNT-2    TO DOT-DB-FUND-AMOUNT.
087700
087800     IF TRX-CR-TYPE
087900         MOVE WS-TRX-TRAN-CODE   TO DOT-CR-TRAN-CODE
088000         MOVE WS-TRX-TRAN-DATE   TO DOT-CR-TRAN-DATE
088100         MOVE WS-TRX-AMOUNT-1    TO DOT-CR-TRAN-AMOUNT
088200         MOVE WS-TRX-SERIAL-1    TO DOT-CR-TRAN-SERIAL
088300         MOVE SPACES             TO DOT-CR-TRAN-DESC-1
088400                                    DOT-CR-TRAN-DESC-2
088500                                    DOT-CR-TRAN-DESC-3
088600                                    DOT-CR-REL-ACCT-KEY
088700         MOVE WS-TRX-AMOUNT-2    TO DOT-CR-HOLD-AMOUNT.
088800
088900     IF TRX-HD-TYPE
089000         MOVE WS-TRX-TRAN-CODE   TO DOT-HD-TRAN-CODE
089100         MOVE WS-TRX-TRAN-DATE   TO DOT-HD-TRAN-DATE
089200         MOVE WS-TRX-AMOUNT-1    TO DOT-HD-TRAN-AMOUNT
089300         MOVE WS-TRX-SERIAL-1    TO DOT-HD-TRAN-SERIAL
089400         MOVE SPACES             TO DOT-HD-TRAN-DESC-1
089500                                    DOT-HD-TRAN-DESC-2
089600                                    DOT-HD-TRAN-DESC-3
089700         MOVE WS-TRX-HOLD-TYPE   TO DOT-HD-HOLD-TYPE
089800         MOVE WS-TRX-REL-DATE    TO DOT-HD-RELEASE-DATE.
089900
090000     IF TRX-SP-TYPE
090100         MOVE WS-TRX-TRAN-CODE   TO DOT-SP-TRAN-CODE
090200         MOVE WS-TRX-TRAN-DATE   TO DOT-SP-TRAN-DATE
090300         MOVE WS-TRX-AMOUNT-1    TO DOT-SP-TRAN-AMOUNT
090400         MOVE WS-TRX-SERIAL-1    TO DOT-SP-TRAN-SERIAL
090500         MOVE SPACES             TO DOT-SP-TRAN-DESC-1
090600                                    DOT-SP-TRAN-DESC-2
090700                                    DOT-SP-TRAN-DESC-3
090800         MOVE WS-TRX-STOP-TYPE   TO DOT-SP-STOP-TYPE
090900         MOVE WS-TRX-STOP-REASON TO DOT-SP-STOP-REASON
091000         MOVE WS-TRX-REL-DATE    TO DOT-SP-RELEASE-DATE
091100         MOVE WS-TRX-AMOUNT-2    TO DOT-SP-HIGH-AMOUNT
091200         MOVE WS-TRX-SERIAL-2    TO DOT-SP-HIGH-SERIAL.
091300
091400     IF TRX-NM-TYPE
091500         MOVE WS-TRX-TRAN-CODE   TO DOT-NM-TRAN-CODE
091600         MOVE WS-TRX-TRAN-DATE   TO DOT-NM-TRAN-DATE
091700         MOVE WS-TRX-ALERT-CODE  TO DOT-NM-TRAN-ALERT
091800         MOVE WS-TRX-NMON-DATA   TO DOT-NM-DESCRIPTION.
091900
092000     MOVE DOT-INSERT-DETAIL      TO DOT-COMM-REQUEST-CODE.
092100     MOVE WS-CUTOFF-DATE         TO DOT-COMM-CUTOFF-DATE.
092200
092300     PERFORM 8000-CALL-DOT-SERVICE.
092400
092500     IF DOT-SUCCESSFUL
092600         NEXT SENTENCE
092700     ELSE
092800     IF DOT-RECORD-MISSING
092900         MOVE WS-RECORD-MISSING-MSG
093000                                 TO WS-ERROR-MESSAGE
093100         MOVE WS-CONTINUE-MSG    TO WS-USER-MESSAGE
093200         PERFORM 3900-RESEND-SCREEN-MAP
093300         GO TO 4000-SECTION-EXIT
093400     ELSE
093500         PERFORM 9500-SERIOUS-ERROR.
093600
093700     MOVE SPACES                 TO WS-ERROR-MESSAGE.
093800     MOVE WS-INSERTED-MSG        TO WS-USER-MESSAGE.
093900     PERFORM 3900-RESEND-SCREEN-MAP.
094000
094100 4000-SECTION-EXIT.
094200
094300     EXIT.
094400     EJECT
      ******************************************************************
      ****            CHECK DAILY DEBIT LIMIT PROCEDURE             ****
      ******************************************************************

       4100-CHECK-DAILY-LIMIT          SECTION.

           MOVE ZERO                   TO WS-DB-DAY-TOTAL.

           INITIALIZE DOT-ONLINE-RECORD.

           MOVE USER-COMM-BANK-NUMBER  TO DOT-BANK-NUMBER.
           MOVE USER-COMM-ACCOUNT-TYPE TO DOT-ACCOUNT-TYPE.
           MOVE USER-COMM-MASTER-KEY   TO DOT-ACCOUNT-KEY.

           MOVE DOT-RETURN-HEADER      TO DOT-COMM-REQUEST-CODE.
           MOVE DOT-AFTER-CUTOFF       TO DOT-COMM-CUTOFF-CODE.
           MOVE WS-CUTOFF-DATE         TO DOT-COMM-CUTOFF-DATE.

           PERFORM 8000-CALL-DOT-SERVICE.

           IF DOT-SUCCESSFUL
               ADD DOT-TPS-DB-AMT-TRANS
                   DOT-ATM-DB-AMT-TRANS
                   DOT-POS-DB-AMT-TRANS
                   DOT-EBS-DB-AMT-TRANS
                   DOT-ACH-DB-AMT-TRANS
                       GIVING WS-DB-DAY-TOTAL.

           COMPUTE WS-DB-NEW-TOTAL =
                   WS-DB-DAY-TOTAL + WS-TRX-AMOUNT-1.

       4100-SECTION-EXIT.

           EXIT.
           EJECT
094500******************************************************************
094600****            DELETE DOT TRANSACTION PROCEDURE              ****
094700******************************************************************
094800
094900 5000-DELETE-TRANSACTION         SECTION.
095000
095100     MOVE WS-NO                  TO WS-RECORD-FOUND-FLAG
095200                                    WS-END-OF-TRANS-FLAG.
095300
095400     INITIALIZE DOT-ONLINE-RECORD.
095500
095600     MOVE USER-COMM-BANK-NUMBER  TO DOT-BANK-NUMBER.
095700     MOVE USER-COMM-ACCOUNT-TYPE TO DOT-ACCOUNT-TYPE.
095800     MOVE USER-COMM-MASTER-KEY   TO DOT-ACCOUNT-KEY.
095900
096000     MOVE DOT-SET-RETRIEVAL      TO DOT-COMM-REQUEST-CODE.
096100     MOVE DOT-AFTER-CUTOFF       TO DOT-COMM-CUTOFF-CODE.
096200     MOVE WS-CUTOFF-DATE         TO DOT-COMM-CUTOFF-DATE.
096300
096400     PERFORM 8000-CALL-DOT-SERVICE.
096500
096600     IF DOT-SUCCESSFUL
096700         NEXT SENTENCE
096800     ELSE
096900         MOVE WS-YES             TO WS-END-OF-TRANS-FLAG
097000         GO TO 5000-DELETE-CONTINUED.
097100
097200     PERFORM 7000-READ-DOT-TRANSACTION
097300         UNTIL RECORD-FOUND
097400            OR END-OF-TRANS
097500
097600     MOVE DOT-END-RETRIEVAL      TO DOT-COMM-REQUEST-CODE.
097700
097800     PERFORM 8000-CALL-DOT-SERVICE.
097900
098000 5000-DELETE-CONTINUED.
098100
098200     IF RECORD-FOUND
098300         NEXT SENTENCE
098400     ELSE
098500         MOVE WS-TRAN-MISSING-MSG
098600                                 TO WS-ERROR-MESSAGE
098700         MOVE WS-CONTINUE-MSG    TO WS-USER-MESSAGE
098800         PERFORM 3900-RESEND-SCREEN-MAP
098900         GO TO 5000-SECTION-EXIT.
099000
099100     MOVE DOT-DELETE-DETAIL      TO DOT-COMM-REQUEST-CODE.
099200
099300     PERFORM 8000-CALL-DOT-SERVICE.
099400
099500     IF DOT-SUCCESSFUL
099600         NEXT SENTENCE
099700     ELSE
099800         PERFORM 9500-SERIOUS-ERROR.
099900
100000     MOVE SPACES                 TO WS-ERROR-MESSAGE.
100100     MOVE WS-DELETED-MSG         TO WS-USER-MESSAGE.
100200     PERFORM 3900-RESEND-SCREEN-MAP.
100300
100400 5000-SECTION-EXIT.
100500
100600     EXIT.
100700     EJECT
100800******************************************************************
100900****                EDIT SCREEN DATA PROCEDURE                ****
101000******************************************************************
101100
101200 6000-EDIT-SCREEN-DATA           SECTION.
101300
101400     INITIALIZE USER-SERVICE-COMMAREA.
101500
101600     MOVE DOT-RETURN-KEYS        TO USER-COMM-REQUEST-CODE.
101700     MOVE WS-TRX-BANK-NUMBER     TO USER-COMM-BANK-NUMBER.
101800     MOVE WS-TRX-ACCOUNT-TYPE    TO USER-COMM-ACCOUNT-TYPE.
101900     MOVE WS-TRX-ACCOUNT-KEY     TO USER-COMM-ACCOUNT-KEY.
102000
102100     PERFORM 8500-CALL-USER-SERVICE.
102200
102300     IF USER-BANK-ERROR
102400         MOVE WS-ERROR           TO WS-BANK-NUMBER-FLAG
102500     ELSE
102600     IF USER-TYPE-ERROR
102700         MOVE WS-ERROR           TO WS-ACCOUNT-TYPE-FLAG
102800     ELSE
102900     IF USER-EDIT-ERROR
103000         MOVE WS-ERROR           TO WS-ACCOUNT-KEY-FLAG.
103100
103200     IF TRX-TPS-TYPE
103300        OR
103400        TRX-ATM-TYPE
103500        OR
103600        TRX-POS-TYPE
103700        OR
103800        TRX-EBS-TYPE
103900        OR
104000        TRX-ACH-TYPE
104100         NEXT SENTENCE
104200     ELSE
104300         MOVE WS-ERROR           TO WS-SERVICE-TYPE-FLAG.
104400
104500     IF TRX-DB-TYPE
104600        OR
104700        TRX-CR-TYPE
104800        OR
104900        (TRX-HD-TYPE AND TRX-TPS-TYPE)
105000        OR
105100        (TRX-SP-TYPE AND TRX-TPS-TYPE)
105200        OR
105300        TRX-NM-TYPE
105400         NEXT SENTENCE
105500     ELSE
105600         MOVE WS-ERROR           TO WS-FORMAT-TYPE-FLAG.
105700
105800     IF WS-TRX-TRAN-DATE NOT EQUAL ZERO
105900         MOVE WS-TRX-TRAN-DATE   TO DUP-GREGORIAN-DATE
106000         PERFORM 7500-EDIT-SCREEN-DATE
106100         IF DATE-SUCCESSFUL
106200             NEXT SENTENCE
106300         ELSE
106400             MOVE WS-ERROR       TO WS-TRAN-DATE-FLAG
106500     ELSE
106600         MOVE WS-ERROR           TO WS-TRAN-DATE-FLAG.
106700
106800     IF WS-TRX-TRAN-CODE EQUAL ZERO
106900         MOVE WS-ERROR           TO WS-TRAN-CODE-FLAG.
107000
107100     IF TRX-DB-TYPE
107200        OR
107300        TRX-CR-TYPE
107400        OR
107500        TRX-NM-TYPE
107600         IF WS-TRX-HOLD-TYPE NOT EQUAL ZERO
107700             MOVE WS-ERROR       TO WS-TYPE-REASON-FLAG.
107800
107900     IF (TRX-HD-TYPE AND TRX-TPS-TYPE)
108000         IF WS-TRX-HOLD-TYPE EQUAL ZERO
108100             MOVE WS-ERROR       TO WS-TYPE-REASON-FLAG.
108200
108300     IF (TRX-SP-TYPE AND TRX-TPS-TYPE)
108400         IF WS-TRX-STOP-TYPE EQUAL ZERO
108500            OR
108600            WS-TRX-STOP-REASON EQUAL ZERO
108700             MOVE WS-ERROR       TO WS-TYPE-REASON-FLAG.
108800
108900     IF TRX-NM-TYPE
109000         IF WS-TRX-AMOUNT-1 NOT EQUAL ZERO
109100             MOVE WS-ERROR       TO WS-AMOUNT-1-FLAG.
109200
109300     IF TRX-DB-TYPE
109400        OR
109500        TRX-CR-TYPE
109600        OR
109700        (TRX-HD-TYPE AND TRX-TPS-TYPE)
109800         IF WS-TRX-AMOUNT-1 EQUAL ZERO
109900             MOVE WS-ERROR       TO WS-AMOUNT-1-FLAG.
110000
110100     IF (TRX-SP-TYPE AND TRX-TPS-TYPE)
110200         IF WS-TRX-AMOUNT-1 EQUAL ZERO
110300            AND
110400            WS-TRX-SERIAL-1 EQUAL ZERO
110500             MOVE WS-ERROR       TO WS-AMOUNT-1-FLAG
110600                                    WS-SERIAL-1-FLAG.
110700
110800     IF TRX-NM-TYPE
110900         IF WS-TRX-AMOUNT-2 NOT EQUAL ZERO
111000             MOVE WS-ERROR       TO WS-AMOUNT-2-FLAG.
111100
111200     IF TRX-DB-TYPE
111300        OR
111400        TRX-CR-TYPE
111500         IF WS-TRX-AMOUNT-2 GREATER THAN WS-TRX-AMOUNT-1
111600             MOVE WS-ERROR       TO WS-AMOUNT-2-FLAG.
111700
111800     IF (TRX-SP-TYPE AND TRX-TPS-TYPE)
111900        AND
112000        WS-TRX-AMOUNT-2 NOT EQUAL ZERO
112100         IF WS-TRX-AMOUNT-2 NOT GREATER THAN WS-TRX-AMOUNT-1
112200             MOVE WS-ERROR       TO WS-AMOUNT-2-FLAG.
112300
112400     IF (TRX-HD-TYPE AND TRX-TPS-TYPE)
112500        OR
112600        TRX-NM-TYPE
112700         IF WS-TRX-SERIAL-1 NOT EQUAL ZERO
112800             MOVE WS-ERROR       TO WS-SERIAL-1-FLAG.
112900
113000     IF TRX-DB-TYPE
113100        OR
113200        TRX-CR-TYPE
113300        OR
113400        (TRX-HD-TYPE AND TRX-TPS-TYPE)
113500        OR
113600        TRX-NM-TYPE
113700         IF WS-TRX-SERIAL-2 NOT EQUAL ZERO
113800             MOVE WS-ERROR       TO WS-SERIAL-2-FLAG.
113900
114000     IF (TRX-SP-TYPE AND TRX-TPS-TYPE)
114100        AND
114200        WS-TRX-SERIAL-2 NOT EQUAL ZERO
114300         IF WS-TRX-SERIAL-2 NOT GREATER THAN WS-TRX-SERIAL-1
114400             MOVE WS-ERROR       TO WS-SERIAL-2-FLAG.
114500
114600     IF TRX-DB-TYPE
114700        OR
114800        TRX-CR-TYPE
114900        OR
115000        TRX-NM-TYPE
115100         IF WS-TRX-REL-DATE EQUAL ZERO
115200             NEXT SENTENCE
115300         ELSE
115400             MOVE WS-ERROR       TO WS-REL-DATE-FLAG
115500     ELSE
115600     IF (TRX-HD-TYPE AND TRX-TPS-TYPE)
115700        OR
115800        (TRX-SP-TYPE AND TRX-TPS-TYPE)
115900         IF WS-TRX-REL-DATE EQUAL 99999999
116000             NEXT SENTENCE
116100         ELSE
116200         IF WS-TRX-REL-DATE NOT EQUAL ZERO
116300            AND
116400            WS-TRX-REL-DATE NOT LESS THAN WS-TRX-TRAN-DATE
116500             MOVE WS-TRX-REL-DATE
116600                                 TO DUP-GREGORIAN-DATE
116700             PERFORM 7500-EDIT-SCREEN-DATE
116800             IF DATE-SUCCESSFUL
116900                 NEXT SENTENCE
117000             ELSE
117100                 MOVE WS-ERROR   TO WS-REL-DATE-FLAG
117200         ELSE
117300             MOVE WS-ERROR       TO WS-REL-DATE-FLAG.
117400
117500     IF TRX-DB-TYPE
117600        OR
117700        TRX-CR-TYPE
117800        OR
117900        (TRX-HD-TYPE AND TRX-TPS-TYPE)
118000        OR
118100        (TRX-SP-TYPE AND TRX-TPS-TYPE)
118200         IF WS-TRX-ALERT-CODE NOT EQUAL ZERO
118300             MOVE WS-ERROR       TO WS-ALERT-CODE-FLAG.
118400
118500     IF TRX-DB-TYPE
118600        OR
118700        TRX-CR-TYPE
118800        OR
118900        (TRX-HD-TYPE AND TRX-TPS-TYPE)
119000        OR
119100        (TRX-SP-TYPE AND TRX-TPS-TYPE)
119200         IF WS-TRX-NMON-DATA NOT EQUAL SPACES
119300             MOVE WS-ERROR       TO WS-NMON-DATA-FLAG.
119400
119500     IF TRX-NM-TYPE
119600        AND
119700        EIBAID EQUAL DFHPF2
119800         IF WS-TRX-NMON-DATA EQUAL SPACES
119900             MOVE WS-ERROR       TO WS-NMON-DATA-FLAG.
120000
120100 6000-SECTION-EXIT.
120200
120300     EXIT.
120400     EJECT
120500******************************************************************
120600****              READ DOT TRANSACTION PROCEDURE              ****
120700******************************************************************
120800
120900 7000-READ-DOT-TRANSACTION       SECTION.
121000
121100     MOVE DOT-RETURN-DETAIL      TO DOT-COMM-REQUEST-CODE.
121200     MOVE DOT-AFTER-CUTOFF       TO DOT-COMM-CUTOFF-CODE.
121300     MOVE WS-CUTOFF-DATE         TO DOT-COMM-CUTOFF-DATE.
121400
121500     PERFORM 8000-CALL-DOT-SERVICE.
121600
121700     IF DOT-SUCCESSFUL
121800        AND
121900        DOT-ACCOUNT-KEY EQUAL USER-COMM-MASTER-KEY
122000         NEXT SENTENCE
122100     ELSE
122200         MOVE WS-YES             TO WS-END-OF-TRANS-FLAG
122300         GO TO 7000-SECTION-EXIT.
122400
122500     IF DOT-SERVICE-TYPE EQUAL WS-TRX-SERVICE-TYPE
122600        AND
122700        DOT-PROCESS-DATE EQUAL WS-TRX-TRAN-DATE
122800         NEXT SENTENCE
122900     ELSE
123000         GO TO 7000-SECTION-EXIT.
123100
123200     IF TRX-DB-TYPE
123300        AND
123400        DOT-DB-TYPE
123500        AND
123600        DOT-DB-TRAN-CODE EQUAL WS-TRX-TRAN-CODE
123700        AND
123800        DOT-DB-TRAN-AMOUNT EQUAL WS-TRX-AMOUNT-1
123900        AND
124000        DOT-DB-FUND-AMOUNT EQUAL WS-TRX-AMOUNT-2
124100         MOVE WS-YES             TO WS-RECORD-FOUND-FLAG.
124200
124300     IF TRX-CR-TYPE
124400        AND
124500        DOT-CR-TYPE
124600        AND
124700        DOT-CR-TRAN-CODE EQUAL WS-TRX-TRAN-CODE
124800        AND
124900        DOT-CR-TRAN-AMOUNT EQUAL WS-TRX-AMOUNT-1
125000        AND
125100        DOT-CR-HOLD-AMOUNT EQUAL WS-TRX-AMOUNT-2
125200         MOVE WS-YES             TO WS-RECORD-FOUND-FLAG.
125300
125400     IF (TRX-HD-TYPE AND TRX-TPS-TYPE)
125500        AND
125600        DOT-HD-TYPE
125700        AND
125800        DOT-HD-TRAN-CODE EQUAL WS-TRX-TRAN-CODE
125900        AND
126000        DOT-HD-TRAN-AMOUNT EQUAL WS-TRX-AMOUNT-1
126100        AND
126200        DOT-HD-TRAN-SERIAL EQUAL WS-TRX-SERIAL-1
126300         MOVE WS-YES             TO WS-RECORD-FOUND-FLAG.
126400
126500     IF (TRX-SP-TYPE AND TRX-TPS-TYPE)
126600        AND
126700        DOT-SP-TYPE
126800        AND
126900        DOT-SP-TRAN-CODE EQUAL WS-TRX-TRAN-CODE
127000        AND
127100        DOT-SP-TRAN-AMOUNT EQUAL WS-TRX-AMOUNT-1
127200        AND
127300        DOT-SP-TRAN-SERIAL EQUAL WS-TRX-SERIAL-1
127400         MOVE WS-YES             TO WS-RECORD-FOUND-FLAG.
127500
127600     IF TRX-NM-TYPE
127700        AND
127800        DOT-NM-TYPE
127900        AND
128000        DOT-NM-TRAN-CODE EQUAL WS-TRX-TRAN-CODE
128100         MOVE WS-YES             TO WS-RECORD-FOUND-FLAG.
128200
128300 7000-SECTION-EXIT.
128400
128500     EXIT.
128600     EJECT
128700******************************************************************
128800****                EDIT SCREEN DATE PROCEDURE                ****
128900******************************************************************
129000
129100 7500-EDIT-SCREEN-DATE           SECTION.
129200
129300     MOVE DUP-GREG-VALIDATION    TO DUP-DATE-REQUEST-CODE.
129400     MOVE DUP-GREGORIAN-DATE     TO DUP-DATE-FIELD-1.
129500     MOVE ZERO                   TO DUP-DATE-FIELD-2
129600                                    DUP-DATE-NBR-DAYS.
129700
129800     CALL 'DUPDATE'           USING DUP-DATE-PARM-LIST.
129900
130000 7500-SECTION-EXIT.
130100
130200     EXIT.
130300     EJECT
130400******************************************************************
130500****                  WRITE MESSAGE PROCEDURE                 ****
130600******************************************************************
130700
130800 7900-WRITE-MESSAGE              SECTION.
130900
131000     EXEC CICS WRITEQ TD
131100               QUEUE  (DOT-MASTER-TERMINAL)
131200               FROM   (WS-ERROR-MESSAGE)
131300               LENGTH (35)
131400     END-EXEC.
131500
131600 7900-SECTION-EXIT.
131700
131800     EXIT.
131900     EJECT
132000******************************************************************
132100****               CALL DOT SERVICE PROCEDURE                 ****
132200******************************************************************
132300
132400 8000-CALL-DOT-SERVICE           SECTION.
132500
132600     MOVE DOT-SERVICE-PROGRAM    TO WS-SERVICE-PROGRAM.
132700     MOVE DOT-FILE-NAME          TO WS-SERVICE-FILE-NAME.
132800     MOVE DOT-ONLINE-RECORD      TO DOT-COMM-RECORD-AREA.
132900
133000     MOVE LENGTH OF DOT-SERVICE-COMMAREA
133100                                 TO DOT-COMM-LENGTH.
133200
133300     EXEC CICS LINK
133400               PROGRAM  (DOT-SERVICE-PROGRAM)
133500               COMMAREA (DOT-SERVICE-COMMAREA)
133600               LENGTH   (DOT-COMM-LENGTH)
133700     END-EXEC.
133800
133900     MOVE DOT-COMM-RECORD-AREA   TO DOT-ONLINE-RECORD.
134000
134100     IF DOT-SUCCESSFUL
134200        OR
134300        DOT-RECORD-MISSING
134400        OR
134500        DOT-END-OF-RECORDS
134600         NEXT SENTENCE
134700     ELSE
134800     IF DOT-CALL-ERROR
134900        OR
135000        DOT-USER-ERROR
135100        OR
135200        DOT-EDIT-ERROR
135300        OR
135400        DOT-DATE-ERROR
135500         PERFORM 9500-PROGRAM-ERROR
135600     ELSE
135700     IF DOT-FILE-PROBLEM
135800         PERFORM 9500-FILE-PROBLEM
135900     ELSE
136000     IF DOT-FILE-CLOSED
136100         PERFORM 9500-FILE-NOT-OPEN
136200     ELSE
136300         PERFORM 9500-SERVICE-ERROR.
136400
136500 8000-SECTION-EXIT.
136600
136700     EXIT.
136800     EJECT
136900******************************************************************
137000****               CALL USER SERVICE PROCEDURE                ****
137100******************************************************************
137200
137300 8500-CALL-USER-SERVICE          SECTION.
137400
137500     MOVE DOT-USER-PROGRAM       TO WS-SERVICE-PROGRAM.
137600
137700     MOVE LENGTH OF USER-SERVICE-COMMAREA
137800                                 TO USER-COMM-LENGTH.
137900
138000     EXEC CICS LINK
138100               PROGRAM  (DOT-USER-PROGRAM)
138200               COMMAREA (USER-SERVICE-COMMAREA)
138300               LENGTH   (USER-COMM-LENGTH)
138400     END-EXEC.
138500
138600     IF USER-SUCCESSFUL
138700        OR
138800        USER-BANK-ERROR
138900        OR
139000        USER-TYPE-ERROR
139100        OR
139200        USER-EDIT-ERROR
139300         NEXT SENTENCE
139400     ELSE
139500     IF USER-CALL-ERROR
139600         PERFORM 9500-PROGRAM-ERROR
139700     ELSE
139800     IF USER-FILE-PROBLEM
139900         PERFORM 9500-FILE-PROBLEM
140000     ELSE
140100     IF USER-FILE-CLOSED
140200         PERFORM 9500-FILE-NOT-OPEN
140300     ELSE
140400         PERFORM 9500-SERVICE-ERROR.
140500
140600 8500-SECTION-EXIT.
140700
140800     EXIT.
140900     EJECT
141000******************************************************************
141100****          SET CICS HANDLE CONDITIONS PROCEDURE            ****
141200******************************************************************
141300
141400 9000-SET-HANDLE-CONDITIONS      SECTION.
141500
141600     EXEC CICS HANDLE CONDITION
141700               PGMIDERR (9500-PROG-NOT-FOUND)
141800               MAPFAIL  (9500-MAP-FAILURE)
141900               INVREQ   (9500-PROGRAM-ERROR)
142000               ERROR    (9500-SERIOUS-ERROR)
142100     END-EXEC.
142200
142300 9000-SECTION-EXIT.
142400
142500     EXIT.
142600     EJECT
142700******************************************************************
142800****         PROCESS CICS HANDLE CONDITION PROCEDURE          ****
142900******************************************************************
143000
143100 9500-PROCESS-HANDLE-CONDITION   SECTION.
143200
143300 9500-PROG-NOT-FOUND.
143400
143500     MOVE WS-PROG-MISSING-MSG    TO WS-MESSAGE-LINE.
143600     MOVE WS-SERVICE-PROGRAM     TO WS-MSG-RESOURCE.
143700     MOVE WS-MESSAGE-LINE        TO WS-ERROR-MESSAGE.
143800     MOVE WS-NOTIFY-MSG          TO WS-USER-MESSAGE.
143900     PERFORM 3900-RESEND-SCREEN-MAP.
144000     PERFORM 7900-WRITE-MESSAGE.
144100     PERFORM 9900-RETURN-TO-PROGRAM.
144200
144300 9500-FILE-PROBLEM.
144400
144500     MOVE WS-FILE-PROBLEM-MSG    TO WS-MESSAGE-LINE.
144600     MOVE WS-SERVICE-FILE-NAME   TO WS-MSG-RESOURCE.
144700     MOVE WS-MESSAGE-LINE        TO WS-ERROR-MESSAGE.
144800     MOVE WS-NOTIFY-MSG          TO WS-USER-MESSAGE.
144900     PERFORM 3900-RESEND-SCREEN-MAP.
145000     PERFORM 7900-WRITE-MESSAGE.
145100     PERFORM 9900-RETURN-TO-PROGRAM.
145200
145300 9500-FILE-NOT-OPEN.
145400
145500     MOVE WS-FILE-CLOSED-MSG     TO WS-MESSAGE-LINE.
145600     MOVE WS-SERVICE-FILE-NAME   TO WS-MSG-RESOURCE.
145700     MOVE WS-MESSAGE-LINE        TO WS-ERROR-MESSAGE.
145800     MOVE WS-CONTINUE-MSG        TO WS-USER-MESSAGE.
145900     PERFORM 3900-RESEND-SCREEN-MAP.
146000     PERFORM 7900-WRITE-MESSAGE.
146100     PERFORM 9900-RETURN-TO-PROGRAM.
146200
146300 9500-MAP-FAILURE.
146400
146500     MOVE WS-MAP-FAILURE-MSG     TO WS-ERROR-MESSAGE.
146600     MOVE WS-NOTIFY-MSG          TO WS-USER-MESSAGE.
146700     PERFORM 3900-RESEND-SCREEN-MAP.
146800     PERFORM 7900-WRITE-MESSAGE.
146900     PERFORM 9900-RETURN-TO-PROGRAM.
147000
147100 9500-PROGRAM-ERROR.
147200
147300     MOVE WS-PROGRAM-ERROR-MSG   TO WS-ERROR-MESSAGE.
147400     MOVE WS-NOTIFY-MSG          TO WS-USER-MESSAGE.
147500     PERFORM 3900-RESEND-SCREEN-MAP.
147600     PERFORM 7900-WRITE-MESSAGE.
147700     PERFORM 9900-RETURN-TO-PROGRAM.
147800
147900 9500-SERVICE-ERROR.
148000
148100     MOVE WS-SERVICE-ERROR-MSG   TO WS-MESSAGE-LINE.
148200     MOVE WS-SERVICE-PROGRAM     TO WS-MSG-RESOURCE.
148300     MOVE WS-MESSAGE-LINE        TO WS-ERROR-MESSAGE.
148400     MOVE WS-NOTIFY-MSG          TO WS-USER-MESSAGE.
148500     PERFORM 3900-RESEND-SCREEN-MAP.
148600     PERFORM 7900-WRITE-MESSAGE.
148700     PERFORM 9900-RETURN-TO-PROGRAM.
148800
148900 9500-SERIOUS-ERROR.
149000
149100     MOVE WS-SERIOUS-ERROR-MSG   TO WS-ERROR-MESSAGE.
149200     MOVE WS-NOTIFY-MSG          TO WS-USER-MESSAGE.
149300     PERFORM 3900-RESEND-SCREEN-MAP.
149400     PERFORM 7900-WRITE-MESSAGE.
149500
149600     EXEC CICS DUMP
149700               DUMPCODE ('DOT5')
149800     END-EXEC.
149900
150000     PERFORM 9900-RETURN-TO-PROGRAM.
150100
150200 9500-SECTION-EXIT.
150300
150400     EXIT.
150500     EJECT
150600******************************************************************
150700****                RETURN TO PROGRAM PROCEDURE               ****
150800******************************************************************
150900
151000 9900-RETURN-TO-PROGRAM          SECTION.
151100
151200     MOVE LENGTH OF PGM-SERVICE-COMMAREA
151300                                 TO PGM-COMM-LENGTH.
151400
151500     EXEC CICS RETURN
151600               TRANSID  (EIBTRNID)
151700               COMMAREA (PGM-SERVICE-COMMAREA)
151800               LENGTH   (PGM-COMM-LENGTH)
151900     END-EXEC.
152000
152100 9900-SECTION-EXIT.
152200
152300     EXIT.
152400     EJECT
152500******************************************************************
152600****                  RETURN TO CICS PROCEDURE                ****
152700******************************************************************
152800
152900 9999-RETURN-TO-CICS             SECTION.
153000
153010     DISPLAY 'DOT500:9999-RETURN-TO-CICS'.
153100     EXEC CICS SEND
153200               CONTROL
153300               ERASE
153400               FREEKB
153500     END-EXEC.
153600
153700     EXEC CICS RETURN
153800     END-EXEC.
153900
154000 9999-SECTION-EXIT.
154100
154200     EXIT.
154300     EJECT
